In [102]:
import pandas as pd
df = pd.read_csv('Salaries.csv')
df.head()

/Users/eniolaajani/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [103]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [104]:
df['BasePay']=df['BasePay'].replace(to_replace = 'Not Provided', value= 0)

In [135]:
df['BasePay']=pd.to_numeric(df['BasePay'])

In [137]:
df['BasePay'].mean()

66323.65685410085

In [138]:
df.describe()

,Id,BasePay,TotalPay,TotalPayBenefits,Year,Notes
count,148654.000000,148049.000000,148654.000000,148654.000000,148654.000000,0.0
mean,74327.500000,66323.656854,74768.321972,93692.554811,2012.522643,NaN
std,42912.857795,42765.447379,50517.005274,62793.533483,1.117538,NaN
min,1.000000,-166.010000,-618.130000,-618.130000,2011.000000,NaN
25%,37164.250000,33583.520000,36168.995000,44065.650000,2012.000000,NaN
50%,74327.500000,65006.930000,71426.610000,92404.090000,2013.000000,NaN
75%,111490.750000,94691.050000,105839.135000,132876.450000,2014.000000,NaN
max,148654.000000,319275.010000,567595.430000,567595.430000,2014.000000,NaN

In [141]:
df['OvertimePay']=df['OvertimePay'].replace(to_replace = 'Not Provided', value= 0)

df['OvertimePay']=pd.to_numeric(df['OvertimePay'])

In [143]:
df['OvertimePay'].max()

245131.88

In [148]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [204]:
df['TotalPay'].value_counts()

 0.00         368
 18594.00      82
 123290.70     56
 132242.50     49
 105489.00     42
             ...
 83836.25       1
 83710.91       1
 83283.97       1
 83425.21       1
-618.13         1
Name: TotalPay, Length: 138486, dtype: int64

In [154]:
df['BasePay'].mean()

66323.65685410085

In [174]:
x =df[['BasePay','Year']][(df['Year']>=2011) & (df['Year']<=2014 )]['BasePay']

In [179]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66557.437750
Name: BasePay, dtype: float64

In [193]:
df['JobTitle'].value_counts().max()

7036

In [203]:
sum(df[df['Year']==2013]['JobTitle'].value_counts()==1)

202

In [205]:
df['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [210]:
def check(x):
    if 'chief' in x.lower().split():
        return True
    else:
        return False

In [216]:
sum(df['JobTitle'].apply(check))

477

In [217]:
df['title_len']=df['JobTitle'].apply(len)

In [219]:
df[['TotalPayBenefits','title_len']].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

In [223]:
df['Status'].fillna("SN",inplace=True)

In [232]:
df['Notes'].isna()

0         True
1         True
2         True
3         True
4         True
          ...
148649    True
148650    True
148651    True
148652    True
148653    True
Name: Notes, Length: 148654, dtype: bool

In [248]:
df.drop(columns='Notes')

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
          ..
148649   NaN
148650   NaN
148651   NaN
148652   NaN
148653   NaN
Name: Notes, Length: 148654, dtype: float64

In [241]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,title_len
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,SN,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,SN,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,SN,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,SN,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,SN,44
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT,9
148650,148651,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,SN,12
148651,148652,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,SN,12
148652,148653,Not provided,Not provided,0.00,0.00,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,SN,12
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT,26